PHONEME_TO_ARABIC = {
    'AA': ('ا', 'َ'), 'AE': ('', 'َ'), 'AH': ('', 'َ'), 'AO': ('و', 'ُ'),
    'AW': ('و', 'َ'), 'AY': ('ي', 'َ'), 'EH': ('', 'ِ'), 'ER': ('ر', 'َ'),
    'EY': ('ي', 'َ'), 'IH': ('', 'ِ'), 'IY': ('ي', 'ِ'),
    'OW': ('و', 'ُ'), 'OY': ('ي', 'ُ'), 'UH': ('', 'ُ'), 'UW': ('و', 'ُ'),
    'B': ('ب', None), 'CH': ('ش', None), 'D': ('د', None), 'DH': ('ذ', None),
    'F': ('ف', None), 'G': ('ج', None), 'HH': ('ه', None), 'JH': ('ج', None),
    'K': ('ك', None), 'L': ('ل', None), 'M': ('م', None), 'N': ('ن', None),
    'NG': ('ن', None), 'P': ('ب', None), 'R': ('ر', None), 'S': ('س', None),
    'SH': ('ش', None), 'T': ('ت', None), 'TH': ('ث', None), 'V': ('ف', None),
    'W': ('و', None), 'Y': ('ي', None), 'Z': ('ز', None), 'ZH': ('ز', None)
}

COMMON_OVERRIDES = {
    'the': 'ذَا', 'this': 'ذِسْ', 'that': 'ذَتْ', 'of': 'أُفْ',
    'and': 'أَنْدْ', 'in': 'إِنْ', 'to': 'تُو', 'a': 'أَ', 'is': 'إِزْ'
}
